aaron-bond.better-comments
bbenoist.nix
christian-kohler.path-intellisense
dbaeumer.vscode-eslint
dracula-theme.theme-dracula
eamodio.gitlens
foxundermoon.shell-format
github.copilot
github.copilot-chat
gruntfuggly.todo-tree
james-yu.latex-workshop
jnoortheen.nix-ide
mkhl.direnv
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.hexeditor
ms-vscode.remote-explorer
slevesque.shader
slevesque.vscode-3dviewer
valentjn.vscode-ltex
xaver.clang-format
yzhang.markdown-all-in-one
