aaron-bond.better-comments
bbenoist.nix
christian-kohler.path-intellisense
dbaeumer.vscode-eslint
dracula-theme.theme-dracula
eamodio.gitlens
github.copilot
github.copilot-chat
gruntfuggly.todo-tree
james-yu.latex-workshop
jnoortheen.nix-ide
mkhl.direnv
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.remote-explorer
slevesque.shader
twxs.cmake
yzhang.markdown-all-in-one
